<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Subject Container
    |--------------------------------------------------------------------------
    |
    |   DON'T ADD ANYTHING TO SUBJECT UNLESS YOU UPDATE COLORS!
    |
    */

    'subjects' => [
        'scientific' => 'علمی',
        'cultural' => 'فرهنگی',
        'art' => 'هنری',
        'social' => 'اجتماعی',
        'sports' => 'ورزشی',
        'charity' => 'نیکو کاری و امور خیریه',
        'philanthropy' => 'بشردوستانه',
        'women_affairs' => 'امور زنان',
        'socially_disadvantaged' => 'آسیب دیدگان اجتماعی',
        'supportive' => 'حمایتی',
        'health_care' => 'بهداشت و درمان',
        'rehabilitation' => 'توانبخشی',
        'environment' => 'محیط زیست',
        'development_and_prosperity' => 'عمران و آبادانی',
        'no_subject' => 'بدون موضوع',
    ],

    'colors' => [
        'علمی' => '#FF0000',
        'فرهنگی' => '#FFA500',
        'هنری' => '#FFFF00',
        'اجتماعی' => '#008000',
        'ورزشی' => '#800080',
        'نیکو کاری و امور خیریه' => '#FF00FF',
        'بشردوستانه' => '#00FF00',
        'امور زنان' => '#00FFFF',
        'آسیب دیدگان اجتماعی' => '#008080',
        'حمایتی' => '#808000',
        'بهداشت و درمان' => '#00FFFF',
        'توانبخشی' => '#0000FF',
        'محیط زیست' => '#800000',
        'عمران و آبادانی' => '#000080',
        'بدون موضوع' => '#000000',
    ],
];
